# IFCGlobalId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCGuidKey..::..IFCGlobalId Property
IFCGuidKey Class See Also
---
IFC GlobalId for map.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public string IFCGlobalId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IFCGlobalId As String
	Get
```

Visual C++
---
```text
public:
property String^ IFCGlobalId {
	String^ get ();
}
```

# See Also
IFCGuidKey Class
Autodesk.Revit.DB.IFC Namespace